Patch gemfile, change architecture to mermaid diagrams
